---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailType
source: html/78adb5d6-ccbe-861b-6bc1-0c921121f829.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailType Property

The type of the secondary handrail.

## Syntax (C#)
```csharp
public ElementId SecondaryHandrailType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The handRailTypeId is not a valid hand rail type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null